{"format": "layers-model", "generatedBy": null, "convertedBy": "TensorFlow.js Converter v4.22.0", "modelTopology": null, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "lstm/kernel", "shape": [257, 512], "dtype": "float32"}, {"name": "lstm/recurrent_kernel", "shape": [128, 512], "dtype": "float32"}, {"name": "lstm/bias", "shape": [512], "dtype": "float32"}, {"name": "lstm_1/kernel", "shape": [128, 512], "dtype": "float32"}, {"name": "lstm_1/recurrent_kernel", "shape": [128, 512], "dtype": "float32"}, {"name": "lstm_1/bias", "shape": [512], "dtype": "float32"}, {"name": "dense/kernel", "shape": [128, 257], "dtype": "float32"}, {"name": "dense/bias", "shape": [257], "dtype": "float32"}, {"name": "conv1d/kernel", "shape": [1, 512, 256], "dtype": "float32"}, {"name": "layer_normalization/gamma", "shape": [256], "dtype": "float32"}, {"name": "layer_normalization/beta", "shape": [256], "dtype": "float32"}, {"name": "lstm_2/kernel", "shape": [256, 512], "dtype": "float32"}, {"name": "lstm_2/recurrent_kernel", "shape": [128, 512], "dtype": "float32"}, {"name": "lstm_2/bias", "shape": [512], "dtype": "float32"}, {"name": "lstm_3/kernel", "shape": [128, 512], "dtype": "float32"}, {"name": "lstm_3/recurrent_kernel", "shape": [128, 512], "dtype": "float32"}, {"name": "lstm_3/bias", "shape": [512], "dtype": "float32"}, {"name": "dense_1/kernel", "shape": [128, 256], "dtype": "float32"}, {"name": "dense_1/bias", "shape": [256], "dtype": "float32"}, {"name": "conv1d_1/kernel", "shape": [1, 256, 512], "dtype": "float32"}]}]}