{"format": "layers-model", "generatedBy": "keras v3.8.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "modelTopology": {"keras_version": "3.8.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "functional", "trainable": true, "layers": [{"class_name": "InputLayer", "config": {"batch_shape": [null, 512], "dtype": "float32", "sparse": false, "name": "input_1"}, "name": "input_1", "inbound_nodes": []}, {"class_name": "TFSMLayer", "config": {"name": "tfsm_layer", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}}, "name": "tfsm_layer", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 512], "dtype": "float32", "keras_history": ["input_1", 0, 0]}}], "kwargs": {}}]}], "input_layers": [["input_1", 0, 0]], "output_layers": {"conv1d_1": ["tfsm_layer", 0, 0]}}}}, "weightsManifest": [{"paths": [], "weights": []}]}